Repository: ibraheem-aletrebi/Quent
Catalog: lib/l10n/intl_*.arb
Languages: ar

# En
source: English
ar: إنجليزي

# Ar
source: Arabic
ar: عربي

# onboarding_one_title
source: Rent your car easily
ar: أجّر عربيتك بسهولة

# onboarding_one_body
source: Choose the car that suits you in minutes without any hassle
ar: اختار العربية اللي تناسبك في دقايق من غير أي تعقيد

# onboarding_two_title
source: Cars near you
ar: عربيات قريبة منك

# onboarding_two_body
source: Find nearby available cars and book instantly
ar: شوف العربيات المتاحة حواليك واحجز فورًا

# onboarding_three_title
source: Pay easily and securely
ar: ادفع بسهولة وأمان

# onboarding_three_body
source: Multiple secure payment methods for your peace of mind
ar: طرق دفع مختلفة وآمنة علشان تطمن

# onboarding_four_title
source: Pick up and start your journey
ar: استلم وابدأ رحلتك

# onboarding_four_body
source: Pick up your car and enjoy the ride
ar: استلم عربيتك واستمتع بالمشوار

# get_started
source: Let’s Get Started
ar: يلا نبدأ

# loginTitle
source: Welcome Back Ready to hit the road.
ar: حمدالله ع السلامة 👋 جاهز تنطلق؟

# loginButton
source: LogIn
ar: تسجيل دخول

source: Remember Me
ar: فاكرني

source: Forgot Password?
ar: نسيت الباسورد؟

# noAccount
source: Don't have an account?
ar: معندكش حساب؟

source: SignUp
ar: إنشاء حساب

source: Email
ar: الإيميل

# emailRequired
source: Please enter your email
ar: من فضلك اكتب الإيميل

# invalidEmail
source: Please enter a valid email
ar: اكتب إيميل صحيح

source: Password
ar: الباسورد

# passwordRequired
source: Please enter your password
ar: من فضلك اكتب الباسورد

# passwordTooShort
source: Password must be at least 8 characters
ar: الباسورد لازم يبقى 8 حروف على الأقل

# invalidPassword
source: Password must contain at least one uppercase letter, one lowercase letter, one number, and one special character
ar: الباسورد لازم يحتوي على حرف كبير وصغير ورقم ورمز

# signupTitle
source: Join us and start your journey today.
ar: انضم لينا وابدأ رحلتك النهارده

source: First Name
ar: الاسم الأول

source: Last Name
ar: اسم العيلة

source: Phone Number
ar: رقم الموبايل

# phoneNumberValidation
source: phone number must be 11 digits
ar: رقم الموبايل لازم يبقى 11 رقم

source: Confirm Password
ar: تأكيد الباسورد

source: Available to add car
ar: متاح تضيف عربية

# signupButton
source: SignUp
ar: إنشاء حساب

# alreadyHaveAccount
source: Already have an account?
ar: عندك حساب بالفعل؟

source: Login
ar: تسجيل دخول

# firstNameRequired
source: Please enter your first name
ar: من فضلك اكتب اسمك الأول

# lastNameRequired
source: Please enter your last name
ar: من فضلك اكتب اسم العيلة

# phoneNumberRequired
source: Please enter your phone number
ar: من فضلك اكتب رقم الموبايل

# confirmPasswordRequired
source: Please enter your confirm password
ar: من فضلك أكد الباسورد

source: Password do not match
ar: الباسوردين مش زي بعض

source: yes
ar: أيوه

source: no
ar: لأ

source: Location
ar: الموقع

source: City
ar: المدينة

# cityRequired
source: Please enter your city
ar: من فضلك اكتب المدينة

# resetPasswordRequestTitle
source: Let’s reset your password
ar: يلا نغيّر الباسورد

# resetPasswordRequestBody
source: Enter your email and we’ll guide you through the reset process.
ar: اكتب الإيميل وإحنا هنمشيك خطوة بخطوة علشان تغيّره

source: Submit
ar: إرسال

source: Back to Login
ar: رجوع لتسجيل الدخول

# resetPasswordOtpTitle
source: Almost there!
ar: فاضل خطوة!

# resetPasswordOtpSubtitle
source: Enter the code we sent to your email to reset your password.
ar: اكتب الكود اللي بعتناه على الإيميل علشان تغيّر الباسورد

# resetPasswordOtpResend
source: Resend Code
ar: إعادة إرسال الكود

source: Next
ar: التالي

# resetPasswordNewPasswordTitle
source: Set a New Password
ar: اعمل باسورد جديد

# resetPasswordNewPasswordSubtitle
source: Enter your new password below to secure your account.
ar: اكتب الباسورد الجديد علشان تأمّن حسابك

source: New Password
ar: باسورد جديد

source: Confirm Password
ar: تأكيد الباسورد

# newPasswordRequired
source: Please enter a new password
ar: من فضلك اكتب باسورد جديد

# emailStep
source: Email
ar: الإيميل

# otpStep
source: OTP
ar: الكود

# newPasswordStep
source: New Password
ar: الباسورد الجديد

source: Back
ar: رجوع

# phoneVerificationtitle
source: Phone Verification
ar: تأكيد رقم الموبايل

# phoneVerificationBody
source: Enter the code we sent to your phone number to verify your account.
ar: اكتب الكود اللي بعتناه على رقمك علشان نأكد حسابك

# phoneVerificationResend
source: Resend Code
ar: إعادة إرسال الكود

source: Skip for now
ar: تخطي دلوقتي

source: Retry
ar: حاول تاني

source: No item found
ar: مفيش حاجة موجودة

source: Search...
ar: دور...

source: Select Location
ar: اختار الموقع

source: Select Country
ar: اختار البلد

source: Select City
ar: اختار المدينة

source: Select Date
ar: اختار التاريخ

source: Select Time
ar: اختار الوقت

source: Select Car
ar: اختار العربية

source: Select Car Type
ar: اختار نوع العربية

source: National ID
ar: الرقم القومي

source: Birth Date
ar: تاريخ الميلاد

# birthDateRequired
source: Please enter your birth date
ar: من فضلك اكتب تاريخ ميلادك

source: Invalid date format
ar: صيغة التاريخ غلط

# ageRestriction
source: You must be at least 18 years old
ar: لازم يكون عندك 18 سنة على الأقل

source: is required
ar: مطلوب

# nationalIdRequired
source: Please enter your national ID
ar: من فضلك اكتب الرقم القومي

# nationalIdValidation
source: National ID must be 14 digits
ar: الرقم القومي لازم يبقى 14 رقم

# countryRequired
source: Please select a country
ar: من فضلك اختار البلد

# locationRequired
source: Please select a location
ar: من فضلك اختار الموقع

# signupSuccess
source: Success! Your account has been created
ar: تمام 👌 حسابك اتعمل بنجاح

# loginSuccess
source: Login successful! Welcome back
ar: تم تسجيل الدخول بنجاح 👋 نورتنا

# otpPhoneRequired
source: Enter the code that we sent to your phone number to verify your account
ar: اكتب الكود اللي بعتناه على رقمك علشان نأكد حسابك

# otpValidation
source: OTP must be 4 digits
ar: الكود لازم يبقى 4 أرقام

source: Copy
ar: نسخ

# otpEmailRequired
source: Enter the code that we sent to your email to verify your account
ar: اكتب الكود اللي بعتناه على الإيميل علشان نأكد حسابك

# otpEmailValidation
source: OTP must be 4 digits
ar: الكود لازم يبقى 4 أرقام

# otpIsNotCorrect
source: Your Code is not correct
ar: الكود اللي دخلته غلط

source: Password changed successfully
ar: تم تغيير الباسورد بنجاح
